In [182]:
# Importing the libraries
import pandas as pd
import numpy as np

In [183]:
# Importing the PyMySQL library to interact with MySQL databases in Python
import pymysql

In [184]:
# Connecting to the MySQL database
conn = pymysql.connect(
    host = "localhost",
    user = "root",
    password = "root",
    database = "zudio"
)

In [185]:
# Creating a cursor object to execute SQL queries and fetch results from the database
cursor = conn.cursor()

In [186]:
# SQL query to retrieve all records from the 'zudio_sales_data' table
query = 'select * from zudio_sales_data'

In [187]:
# Executing the SQL query and loading the data into a pandas DataFrame
data = pd.read_sql(query, conn)

# DataFrame content
data

C:\Users\PRASHANT\AppData\Local\Temp\ipykernel_26568\1775826969.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql(query, conn)

,Store,Country,State,City,Category,Clothing Type,Store Number,Postal Code,Store Type,Store Open Date,...,Security Features,Order ID,Order Date,Month,Customer ID,Customer Name,Product ID,Price,Quantity,Sales Profit
0,Zudio,India,Karnataka,Jalna,Women,Dresses,30,411084,Owned,2022-06-04,...,Alarm,88240,2024-11-06,November,233084,Michele Ochoa,354,1958,5,3916.0
1,Zudio,India,Gujarat,Patna,Kids,Skirts,48,404562,Owned,2020-12-19,...,Alarm,78145,2024-06-17,June,926472,Daniel Jimenez,741,2078,1,831.2
2,Zudio,India,Uttar Pradesh,Kolkata,Men,Hoodies,97,437773,Rented,2023-09-04,...,CCTV,33363,2024-08-17,August,853255,Steven Davis,607,1445,2,1156.0
3,Zudio,India,West Bengal,Kolkata,Women,Dresses,93,431725,Owned,2024-04-11,...,CCTV,46682,2024-03-27,March,106146,Derek Orozco,991,2469,6,5925.6
4,Zudio,India,West Bengal,Guwahati,Men,Dresses,51,415370,Owned,2022-05-29,...,"CCTV, Alarm",58242,2024-04-08,April,264070,Victor Arnold,479,1105,6,2652.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
14682,Zudio,India,Uttar Pradesh,Chandigarh,Kids,Jeans,32,431437,Owned,2024-04-24,...,"CCTV, Alarm",39056,2024-09-27,September,591993,Tracey Andrews,262,2838,1,1135.2
14683,Zudio,India,Uttar Pradesh,Aurangabad,Kids,Jackets,52,424643,Owned,2024-02-03,...,Alarm,85486,2024-03-16,March,822244,Linda Wallace,537,1814,2,1451.2
14684,Zudio,India,Tamil Nadu,Pune,Kids,T-shirts,81,412057,Owned,2021-04-11,...,"CCTV, Alarm",78200,2024-12-02,December,268376,Brandon Baker,457,1961,1,784.4
14685,Zudio,India,Delhi,Madurai,Men,Shoes,58,405203,Rented,2022-06-17,...,CCTV,19883,2024-07-29,July,766283,John Lewis,608,1017,8,3254.4
14686,Zudio,India,Gujarat,Bengaluru,Women,Shirts,20,429823,Owned,2023-02-08,...,"CCTV, Alarm",91451,2024-04-08,April,541226,Nicholas Salazar,583,2773,5,5546.0

In [188]:
# Summary statistics (count, mean, std, min, max, etc.) for numeric columns in the DataFrame
data.describe()

,Store Number,Postal Code,Selling Area Size (sq ft),Staff Count,Order ID,Customer ID,Product ID,Price,Quantity,Sales Profit
count,14687.000000,14687.000000,14687.000000,14687.000000,14687.000000,14687.000000,14687.000000,14687.000000,14687.000000,14687.000000
mean,50.645945,420035.660516,1112.010622,11.487778,54980.511541,549780.291142,602.234221,1759.069245,4.523388,3169.150106
std,29.082515,11694.154148,193.398705,5.191102,25925.211247,262297.413771,232.236700,715.688512,2.292984,2138.437928
min,1.000000,400006.000000,800.000000,3.000000,10008.000000,100153.000000,204.000000,499.000000,1.000000,200.400000
25%,25.000000,409892.000000,950.000000,7.000000,33181.000000,318885.000000,399.000000,1136.000000,3.000000,1410.000000
50%,51.000000,420083.000000,1100.000000,12.000000,55009.000000,546415.000000,601.000000,1778.000000,5.000000,2681.600000
75%,76.000000,430319.500000,1300.000000,16.000000,77386.500000,780141.000000,804.000000,2372.000000,7.000000,4572.400000
max,100.000000,439985.000000,1400.000000,20.000000,99999.000000,999858.000000,999.000000,2999.000000,8.000000,9596.800000

In [189]:
# Display the column names of the DataFrame
data.columns

Index(['Store', 'Country', 'State', 'City', 'Category', 'Clothing Type',
       'Store Number', 'Postal Code', 'Store Type', 'Store Open Date',
       'Selling Area Size (sq ft)', 'Store Manager', 'Manager ID',
       'Store Address', 'Contact Information', 'Operating Hours',
       'Staff Count', 'Parking Availability', 'Security Features', 'Order ID',
       'Order Date', 'Month', 'Customer ID', 'Customer Name', 'Product ID',
       'Price', 'Quantity', 'Sales Profit'],
      dtype='object')

In [190]:
# Calculating the number of null values in each column of the DataFrame
data.isnull().sum()

Store                        0
Country                      0
State                        0
City                         0
Category                     0
Clothing Type                0
Store Number                 0
Postal Code                  0
Store Type                   0
Store Open Date              0
Selling Area Size (sq ft)    0
Store Manager                0
Manager ID                   0
Store Address                0
Contact Information          0
Operating Hours              0
Staff Count                  0
Parking Availability         0
Security Features            0
Order ID                     0
Order Date                   0
Month                        0
Customer ID                  0
Customer Name                0
Product ID                   0
Price                        0
Quantity                     0
Sales Profit                 0
dtype: int64

In [191]:
# Summary of the DataFrame, including data types and non-null counts for each column
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14687 entries, 0 to 14686
Data columns (total 28 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Store                      14687 non-null  object
 1   Country                    14687 non-null  object
 2   State                      14687 non-null  object
 3   City                       14687 non-null  object
 4   Category                   14687 non-null  object
 5   Clothing Type              14687 non-null  object
 6   Store Number               14687 non-null  int64
 7   Postal Code                14687 non-null  int64
 8   Store Type                 14687 non-null  object
 9   Store Open Date            14687 non-null  object
 10  Selling Area Size (sq ft)  14687 non-null  int64
 11  Store Manager              14687 non-null  object
 12  Manager ID                 14687 non-null  object
 13  Store Address              14687 non-null  object
 14  Contact Information        14687 non-null  object
 15  Operating Hours            14687 non-null  object
 16  Staff Count                14687 non-null  int64
 17  Parking Availability       14687 non-null  object
 18  Security Features          14687 non-null  object
 19  Order ID                   14687 non-null  int64
 20  Order Date                 14687 non-null  object
 21  Month                      14687 non-null  object
 22  Customer ID                14687 non-null  int64
 23  Customer Name              14687 non-null  object
 24  Product ID                 14687 non-null  int64
 25  Price                      14687 non-null  int64
 26  Quantity                   14687 non-null  int64
 27  Sales Profit               14687 non-null  float64
dtypes: float64(1), int64(9), object(18)
memory usage: 3.1+ MB

# What is the total revenue generated by each store?

In [193]:
query = """SELECT Store, SUM(Price * Quantity) AS Total_Revenue FROM zudio_sales_data GROUP BY Store;"""
cursor.execute(query)
data = cursor.fetchall()
print(data)

(('Zudio', Decimal('116363269')),)

# Which city's stores have the highest and lowest average sales profits??

In [195]:
query = """(SELECT City, AVG(`Sales Profit`) AS Avg_Profit FROM Zudio_sales_data GROUP BY City ORDER BY Avg_Profit DESC LIMIT 1)
UNION ALL
(SELECT City, AVG(`Sales Profit`) AS Avg_Profit FROM Zudio_sales_data GROUP BY City ORDER BY Avg_Profit ASC LIMIT 1);"""
cursor.execute(query)
data = cursor.fetchall()
print(data)

(('Kolhapur', 3493.3240963855396), ('Solapur', 2879.0608695652177))

# What are the top 5 Clothing type contributing to overall revenue?

In [197]:
query = """SELECT `Clothing Type`, SUM(Price * Quantity) AS Revenue FROM zudio_sales_data GROUP BY `Clothing Type`
ORDER BY Revenue DESC LIMIT 5;"""
cursor.execute(query)
data = cursor.fetchall()
print(data)

(('Dresses', Decimal('11211112')), ('Pants', Decimal('10745494')), ('Jackets', Decimal('10730366')), ('Sweaters', Decimal('10715823')), ('Skirts', Decimal('10698544')))

# Which months have the highest and lowest sales profits?

In [199]:
query = """(SELECT Month, SUM(`Sales Profit`) AS Total_Profit FROM zudio_sales_data GROUP BY Month
ORDER BY Total_Profit DESC LIMIT 1)
UNION ALL
(SELECT Month, SUM(`Sales Profit`) AS Total_Profit FROM zudio_sales_data GROUP BY Month
ORDER BY Total_Profit ASC LIMIT 1);"""
cursor.execute(query)
data = cursor.fetchall()
print(data)

(('October', 4415818.8), ('December', 413023.2))

# How many customers are unique for each store?

In [201]:
query = """SELECT Store, COUNT(DISTINCT `Customer ID`) AS Unique_Customers FROM zudio_sales_data GROUP BY Store;"""
cursor.execute(query)
data = cursor.fetchall()
print(data)

(('Zudio', 7870),)

# What is the total sales profit for each State?

In [203]:
query = """SELECT State, SUM(`Sales Profit`) AS Total_Profit FROM zudio_sales_data GROUP BY State;"""
cursor.execute(query)
data = cursor.fetchall()
print(data)

(('Karnataka', 5592215.599999999), ('Gujarat', 5670416.399999996), ('Uttar Pradesh', 5833371.200000006), ('West Bengal', 6031095.199999998), ('Maharashtra', 5777392.399999995), ('Tamil Nadu', 5725390.800000011), ('Rajasthan', 5949801.200000007), ('Delhi', 5965624.800000001))

# Find the top 5 customers based on total sales profit.

In [205]:
query = """SELECT `Customer Name`, SUM(`Sales Profit`) AS Total_Profit FROM Zudio_sales_data GROUP BY `Customer Name`
ORDER BY Total_Profit DESC LIMIT 5;"""
cursor.execute(query)
data = cursor.fetchall()
print(data)

(('Jonathan Brown', 41980.8), ('Christopher Smith', 40674.40000000001), ('Michael Williams', 39048.0), ('Sarah Smith', 30322.399999999998), ('Jessica Jones', 30192.399999999998))

# What is the trend of sales profits over time (monthly)?

In [207]:
query = """SELECT Month, SUM(`Sales Profit`) AS Total_Profit FROM zudio_sales_data GROUP BY Month ORDER BY FIELD
(Month, 'January', 'February', 'March', 'April', 'May', 'June','July', 'August', 'September', 'October', 'November', 'December');"""
cursor.execute(query)
data = cursor.fetchall()
print(data)

(('January', 4254612.4), ('February', 4063439.1999999946), ('March', 4232094.4), ('April', 4243590.4), ('May', 4188934.8000000007), ('June', 3960287.2000000016), ('July', 4094102.0), ('August', 4319656.799999999), ('September', 4034578.0000000005), ('October', 4415818.8), ('November', 4325170.400000003), ('December', 413023.2))

# How many products were sold by each Clothing Type?

In [209]:
query = """SELECT `Clothing Type`, SUM(Quantity) AS Total_Products_Sold FROM zudio_sales_data GROUP BY `Clothing Type`;"""
cursor.execute(query)
data = cursor.fetchall()
print(data)

(('Dresses', Decimal('6392')), ('Skirts', Decimal('6088')), ('Hoodies', Decimal('6100')), ('Jackets', Decimal('6104')), ('Tops', Decimal('6030')), ('Shoes', Decimal('5816')), ('Jeans', Decimal('5828')), ('Pants', Decimal('6028')), ('Sweaters', Decimal('5948')), ('T-shirts', Decimal('6184')), ('Shirts', Decimal('5917')))

# Which cities have the highest number of stores?

In [211]:
query = """SELECT City, COUNT(*) AS Store_Count FROM Zudio_sales_data GROUP BY City ORDER BY Store_Count DESC;"""
cursor.execute(query)
data = cursor.fetchall()
print(data)

(('Kolkata', 395), ('Mysuru', 392), ('Jammu', 384), ('Bhopal', 381), ('Madurai', 379), ('Coimbatore', 379), ('Indore', 378), ('Rajkot', 375), ('Jalna', 375), ('Hyderabad', 375), ('New Delhi', 375), ('Pune', 372), ('Ahmedabad', 363), ('Chhattisgarh', 363), ('Visakhapatnam', 360), ('Chandigarh', 357), ('Noida', 355), ('Bengaluru', 355), ('Jaipur', 355), ('Lucknow', 351), ('Varanasi', 349), ('Kanpur', 349), ('Kochi', 349), ('Surat', 349), ('Solapur', 345), ('Agra', 341), ('Nashik', 337), ('Chennai', 337), ('Vadodara', 336), ('Ranchi', 336), ('Nagpur', 334), ('Kolhapur', 332), ('Patna', 330), ('Meerut', 330), ('Satara', 330), ('Goa', 329), ('Guwahati', 321), ('Faridabad', 317), ('Pondicherry', 307), ('Aurangabad', 306), ('Thane', 304), ('Mumbai', 300))

# Which are the top 10 customers with highest order?

In [213]:
query = """SELECT `Customer Name`, COUNT(`Order ID`) AS Total_Orders FROM Zudio_sales_data GROUP BY `Customer Name`
ORDER BY Total_Orders DESC LIMIT 10;"""
cursor.execute(query)
data = cursor.fetchall()
print(data)

(('Christopher Smith', 9), ('Michael Smith', 8), ('Michael Anderson', 8), ('Daniel Jones', 8), ('Michael Williams', 8), ('Michael Brown', 7), ('William Smith', 7), ('Sarah Smith', 7), ('Robert Brown', 7), ('Michael Jones', 7))

# Identify the top 3 states with the highest sales profits.

In [215]:
query = """SELECT State, SUM(`Sales Profit`) AS Total_Profit FROM Zudio_sales_data GROUP BY State
ORDER BY Total_Profit DESC LIMIT 3;"""
cursor.execute(query)
data = cursor.fetchall()
print(data)

(('West Bengal', 6031095.199999998), ('Delhi', 5965624.800000001), ('Rajasthan', 5949801.200000007))